#**Karakter Escape Python**

In [ ]:
#Notasi Backslash		
#\a		Append
#\b		Backspace
#\cx	 	Control-x
#\C-x	 	Control-x
#\e		Escape
#\f		Formfeed
#\M-\C-	 	Meta-Control-x
#\n		Newline
#\nnn	 	Octal notation, dimana n berada di range 0.7
#\r		Carriage return
#\s		Space
#\t		Tab
#\v		Vertical tab
#\x	 	Character x
#\xnn	 	Notasi Hexadecimal, dimana n berada di range 0. 9, a.f, atau A.F

# **Write and Read File in Python**

In [ ]:
import os

In [ ]:
print(os.getcwd())

/content

In [ ]:
writefile = open('example.txt','w') #pembuatan file example.txt
writefile.write("Welcome to Digital Skola") #penginputan kedalam file "example.txt"
writefile.close()
readfile = open('example.txt','r') #membuka/ memanggil file "example.txt"
print(readfile.read()) # membuka/memanggil isi dari file "example.txt"
readfile.close()

Welcome to Digital Skola

In [ ]:
with open('example.txt','w') as writefile:
  writefile.write('Ini baris 1\n')
  writefile.write('Ini baris 2\n')
  writefile.write('Ini baris 3\n')
  writefile.write('Ini baris 4\n')

In [ ]:
with open('example.txt','r') as readfile:
  print(readfile.read())

Ini baris 1
Ini baris 2
Ini baris 3
Ini baris 4

In [ ]:
with open('example.txt','a') as appendfile: #a adalah appendfile yang berfungsi menambahkan item dari belakang.
  appendfile.write('Ini baris 5\n')

In [ ]:
with open('example.txt','r') as readfile:
  print(readfile.read())

Ini baris 1
Ini baris 2
Ini baris 3
Ini baris 4
Ini baris 5
Ini baris 5
Ini baris 5

# **Database Connection**

In [ ]:
!pip install psycopg2 # psycopg2 adalah database adaptor PostgreSQL untuk bahasa pemrograman Python.

Requirement already satisfied: psycopg2 in /usr/local/lib/python3.7/dist-packages (2.7.6.1)

In [ ]:
import psycopg2 


#mengkoneksikan degan database yang ada
conn = psycopg2.connect( #conn(): This function is used for establishing a connection with the MySQL server. The following are the arguments that are used to initiate a connection:
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox", #Basis data di PostgreSQL untuk membuat Tabel
        user = "group_a", #Nama pengguna yang terkait dengan server MySQL yang digunakan untuk mengotentikasi koneksi
        password = "hZrJQJ8RMttts9VZnUYZX93pr")  #Kata sandi yang terkait dengan nama pengguna untuk otentikasi

#membuat objek menggunakan metode kursor
cursor = conn.cursor() #Kursor adalah ruang kerja yang dibuat dalam memori sistem ketika perintah SQL dijalankan. 
                       #Memori ini bersifat sementara dan koneksi kursor dibatasi untuk seluruh sesi/seumur hidup dan perintah dijalankan

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

# **Create Table**

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

cursor = conn.cursor()

cursor.execute("DROP TABLE IF EXISTS sandbox.batch_2.bus")

sql = '''
      create table sandbox.batch_2.bus (
      id int,
      origin varchar,
      destination varchar,
      time time
)'''

cursor.execute(sql)
print("Table created successfully..")

conn.commit()

conn.close()

Table created successfully..

# **Insert Data**

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")


cursor = conn.cursor()

sql ='''insert into sandbox.batch_2.bus values  
        (100, 'Jakarta', 'Bandung', '10:00'),
        (200, 'Jakarta', 'Palembang', '11:00'),
        (300, 'Jakarta', 'Jogja', '12:00')''' #menginput data kedalam table

cursor.execute(sql)

conn.commit() #fuction postgreeSQL mengakhiri semua transaksi dan menjadikannya sebagai perubahan permanen.
print("Data inserted successfully..")

conn.close()

Data inserted successfully..

# **Select Data**

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")


cursor = conn.cursor()

sql ='''select * from sandbox.batch_2.bus'''

cursor.execute(sql)

result = cursor.fetchall(); #mengembalikan set hasil yang berisi sebuah array dari semua lini yang tersisa.
print(result)

conn.commit()

conn.close()

[(100, 'Jakarta', 'Bandung', datetime.time(10, 0)), (200, 'Jakarta', 'Palembang', datetime.time(11, 0)), (300, 'Jakarta', 'Jogja', datetime.time(12, 0))]

Or We can select data using pandas

In [ ]:
import pandas as pd

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

In [ ]:
sql_statement = '''
      select * 
      from sandbox.datasource.employees e
      join sandbox.datasource.departments d on e.department_id = d.department_id
'''

In [ ]:
df = pd.read_sql(sql_statement, con=conn)

In [ ]:
df.head()

   employee_id first_name last_name  ... department_name manager_id location_id
0        100.0     Steven      King  ...       Executive      100.0      1700.0
1        101.0      Neena   Kochhar  ...       Executive      100.0      1700.0
2        102.0        Lex   De Haan  ...       Executive      100.0      1700.0
3        103.0  Alexander    Hunold  ...              IT      103.0      1400.0
4        104.0      Bruce     Ernst  ...              IT      103.0      1400.0

[5 rows x 15 columns]

# **Update Table**

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

#creating object using the cursor method
cursor = conn.cursor()

print('Data sebelum diupdate')
sql = '''
      select * from sandbox.batch_2.bus
'''
cursor.execute(sql)
print(cursor.fetchall())


print('Data sesudah diupdate')
sql = '''
      update sandbox.batch_2.bus
      set id = 100, origin = 'Medan', destination = 'Bandung', time = '10:00'
      where id = 100 
    ''' #command Update untuk memperbaharui isi table
cursor.execute(sql)

sql = '''
      select * from sandbox.batch_2.bus
''' #Command select untuk memilih tabel yang akan dieksekusi
cursor.execute(sql)
print(cursor.fetchall())

conn.commit()

conn.close()

Data sebelum diupdate
[(100, 'Jakarta', 'Bandung', datetime.time(10, 0)), (200, 'Jakarta', 'Palembang', datetime.time(11, 0)), (300, 'Jakarta', 'Jogja', datetime.time(12, 0))]
Data sesudah diupdate
[(200, 'Jakarta', 'Palembang', datetime.time(11, 0)), (300, 'Jakarta', 'Jogja', datetime.time(12, 0)), (100, 'Medan', 'Bandung', datetime.time(10, 0))]

# **Delete Data**

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

#creating object using the cursor method
cursor = conn.cursor()

print('Data sebelum didelete')
sql = '''
      select * from sandbox.batch_2.bus
'''
cursor.execute(sql)
print(cursor.fetchall())

print('Data sesudah didelete')
sql = '''
      delete from sandbox.batch_2.bus where id = 100
    ''' #command delete untuk menghapus isi table yang dipilih
cursor.execute(sql)

sql = '''
      select * from sandbox.batch_2.bus
'''
cursor.execute(sql)
print(cursor.fetchall())

conn.commit()

conn.close()

Data sebelum didelete
[(200, 'Jakarta', 'Palembang', datetime.time(11, 0)), (300, 'Jakarta', 'Jogja', datetime.time(12, 0)), (100, 'Medan', 'Bandung', datetime.time(10, 0))]
Data sesudah didelete
[(200, 'Jakarta', 'Palembang', datetime.time(11, 0)), (300, 'Jakarta', 'Jogja', datetime.time(12, 0))]

# **Drop Table**

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

cursor = conn.cursor()

sql = '''
      drop table sandbox.batch_2.bus
''' #command drop untuk menghapus table

cursor.execute(sql)
print("Table sudah dihapus")

conn.commit()

conn.close()

Table sudah dihapus

# **Cara Query dari CSV**

In [ ]:
!pip install sqldf
import sqldf
import pandas as pd

Collecting sqldf
  Downloading https://files.pythonhosted.org/packages/60/4b/1a9f9f65bcc7cd8d724c700f469f9bbe3e796b3543e0d346e3e352a283d7/sqldf-0.4.2-py3-none-any.whl
Installing collected packages: sqldf
Successfully installed sqldf-0.4.2

In [ ]:
create table_testing_1

as
with 
var_1 as(
    select *
    from table 1
),

table_b as(
    select *
    from(
        select *
         from table_1
    )
    left join table 2
),

In [ ]:
california_housing = pd.read_csv('sample_data/california_housing_test.csv') #membaca database california_Housing
california_train = pd.read_csv('sample_data/california_housing_train.csv') #membaca database californi_train

In [ ]:
california_housing.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [ ]:
sql = '''
      select a.longitude longitude_a, a.latitude, b.longitude as longitude_b
      from california_housing as a
      join california_train as b using(longitude) -- on a.longitude = b.longitude
''' #memilih beberapa kolom dari California_Housing untuk digabungkan/Join dengan California Train yang diletakan di kiri

In [ ]:
df = sqldf.run(sql)

In [ ]:
df

        longitude_a  latitude  longitude_b
0           -122.05     37.37      -122.05
1           -122.05     37.37      -122.05
2           -122.05     37.37      -122.05
3           -122.05     37.37      -122.05
4           -122.05     37.37      -122.05
...             ...       ...          ...
152545      -119.63     34.42      -119.63
152546      -119.63     34.42      -119.63
152547      -119.63     34.42      -119.63
152548      -119.63     34.42      -119.63
152549      -119.63     34.42      -119.63

[152550 rows x 3 columns]